#include "InputKey.hpp"



/// ------------------------------------------------------------------------------------------------------------

int KeyData::m_key[256];
char KeyData::m_tmpKey[256];



/// ------------------------------------------------------------------------------------------------------------
void KeyData::UpDate()
{
	GetHitKeyStateAll(m_tmpKey);	// 全てのキーの入力状態を得る


	// 全キー入力
	for (int i = 0; i < 256; i++)
	{
		// i番のキーコードに対応するキーが押されていたら
		if (m_tmpKey[i] != 0)
		{
			m_key[i]++;
		}
		// キーが離された瞬間
		else if (m_key[i] > 0)
		{
			m_key[i] = -1;
		}
		// アクションがない
		else // else if (m_key[i] < 0)
		{
			m_key[i] = 0;
		}
	}
}